app/Controllers/Parkir.php

SELECT SUM(capacity) as capacity
FROM `tb_capacity`
WHERE `lokasi` = 'Stall GR'
OR `lokasi` = 'Parkiran Bayangan GR'
OR `lokasi` = 'Parkiran GR'
SELECT SUM(capacity) as capacity
FROM `tb_capacity`
WHERE `lokasi` = 'Stall BP'
OR `lokasi` = 'Parkiran Bayangan BP'
OR `lokasi` = 'Parkiran BP'
---
    public function index()
    {
        $date             = date('Y-m-d');
        $prevDate         = date('Y-m-d', strtotime('- 1 days'));
        $kapasitas        = $this->kapasitas->select('SUM(capacity) as kapasitas')->get()->getFirstRow()->kapasitas;
        $parkirExist      = $this->parkir->select('COUNT(id) as exist')->where('created_at', $date)->get()->getRowArray()['exist'];
        $prevDateParkirExist  = $this->parkir->select('grup, position, model_code, others, license_plate, category, status, lokasi, jenis_parkir')->where('created_at', $prevDate)->get()->getResultArray();


        $GRVehicle        = $this->parkir->select('*')->where('category', 'GR')->where('created_at', $date)->get()->getResultArray();
        $BPVehicle        = $this->parkir->select('*')->where('category', 'BP')->where('created_at', $date)->get()->getResultArray();
        $GRCapacity       = $this->kapasitas->select('SUM(capacity) as capacity')->where('lokasi', 'Stall GR')->orWhere('lokasi', 'Parkiran Bayangan GR')->orWhere('lokasi', 'Parkiran GR')->get()->getRowArray()['capacity'];
        $BPCapacity       = $this->kapasitas->select('SUM(capacity) as capacity')->where('lokasi', 'Stall BP')->orWhere('lokasi', 'Parkiran Bayangan BP')->orWhere('lokasi', 'Parkiran BP')->get()->getRowArray()['capacity'];