app/Controllers/Parkir.php

    public function tambah_parkir()
    {
        $data = $_POST['parking'];

        if (isset($_POST['id'])) {
            $data['id'] = $_POST['id'];
        }

        $save = $this->parkir->save($data);
---
UPDATE `tb_parking` SET `lokasi` = 'DEPAN', `grup` = 'B', `position` = '6', `license_plate` = 'B554ACSA', `model_code` = 'FT', `status` = 'Menunggu Perbaikan GR', `category` = 'BP', `updated_at` = '2022-08-11 23:27:08'
WHERE `tb_parking`.`id` IN ('3')