app/Models/ParkirModel.php

SELECT *
FROM `tb_model_kendaraan`
---
    public function _getListModel()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table("tb_model_kendaraan");
        return $builder->select('*')->get()->getResultArray();

SELECT *
FROM `tb_model_kendaraan`
LEFT JOIN `tb_parking` ON `tb_parking`.`model_code` = `tb_model_kendaraan`.`model_code`
WHERE `grup` = 'P'
AND `position` = '2'
AND `created_at` = '2022-08-19'
---
    public function _getParkirDetail($posisi, $grup)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table("tb_model_kendaraan");
        return $builder->select('*')->join('tb_parking', 'tb_parking.model_code = tb_model_kendaraan.model_code', 'LEFT')->where('grup', $grup)->where('position', $posisi)->get()->getFirstRow();